Tekla.Structures.Geometry3d.PolymeshEdgeTypeEnum
The type of the polymesh edge. This should always correspond 1:1 with
geometry::IndirectEdge_s::EdgeType_e on the Tekla Structures Core side

Tekla.Structures.Geometry3d.PolymeshEdgeTypeEnum.VISIBLE_EDGE
Explicitly states that this edge is visible

Tekla.Structures.Geometry3d.PolymeshEdgeTypeEnum.INVISIBLE_EDGE
For hiding edges in visualizations